       IDENTIFICATION DIVISION.
       PROGRAM-ID. BANK-DEMO-V2.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-ACCOUNT-BALANCE    PIC 9(7)V99 VALUE 5000.00.
       01 WS-WITHDRAW-AMOUNT    PIC 9(5)V99 VALUE 1200.00.
       01 WS-RISK-SCORE         PIC 9(03)   VALUE 025.
       01 WS-STATUS-CODE        PIC X(04)   VALUE "INIT".
       01 WS-AUDIT-FLAG         PIC 9(01)   VALUE 0.
       01 WS-FRAUD-ALERT        PIC 9(01)   VALUE 0.

       PROCEDURE DIVISION.
       0000-MAIN-LOGIC.
           PERFORM 1000-VALIDATE-REQUEST.
           PERFORM 1500-EVALUATE-RISK.
           IF WS-STATUS-CODE = "OKAY" AND WS-FRAUD-ALERT = 0
               PERFORM 2000-PROCESS-WITHDRAWAL
               PERFORM 3000-AUDIT-TRANSACTION
               PERFORM 3500-NOTIFY-CUSTOMER
           ELSE
               PERFORM 4000-HANDLE-REJECTION
               PERFORM 4500-LOG-SUSPICIOUS-EVENT
           END-IF.
           STOP RUN.

       1000-VALIDATE-REQUEST.
           IF WS-WITHDRAW-AMOUNT <= WS-ACCOUNT-BALANCE
               MOVE "OKAY" TO WS-STATUS-CODE
           ELSE
               MOVE "FAIL" TO WS-STATUS-CODE
           END-IF.

       1500-EVALUATE-RISK.
           IF WS-RISK-SCORE > 80
               MOVE 1 TO WS-FRAUD-ALERT
           ELSE
               MOVE 0 TO WS-FRAUD-ALERT
           END-IF.

       2000-PROCESS-WITHDRAWAL.
           SUBTRACT WS-WITHDRAW-AMOUNT FROM WS-ACCOUNT-BALANCE.
           MOVE "DONE" TO WS-STATUS-CODE.

       3000-AUDIT-TRANSACTION.
           MOVE 1 TO WS-AUDIT-FLAG.

       3500-NOTIFY-CUSTOMER.
           MOVE 2 TO WS-AUDIT-FLAG.

       4000-HANDLE-REJECTION.
           MOVE 9 TO WS-AUDIT-FLAG.

       4500-LOG-SUSPICIOUS-EVENT.
           MOVE 8 TO WS-AUDIT-FLAG.
