       IDENTIFICATION DIVISION.
       PROGRAM-ID. CREDIT-CARD-FEES.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-TRAN-AMOUNT        PIC 9(5)V99 VALUE 02500.00.
       01 WS-IS-INTERNATIONAL   PIC X(01)   VALUE "Y".
       01 WS-IS-CASH-ADVANCE    PIC X(01)   VALUE "N".
       01 WS-BASE-FEE           PIC 9(4)V99 VALUE 0.00.
       01 WS-INTL-SURCHARGE     PIC 9(4)V99 VALUE 0.00.
       01 WS-CASH-ADV-FEE       PIC 9(4)V99 VALUE 0.00.
       01 WS-TOTAL-FEE          PIC 9(4)V99 VALUE 0.00.
       01 WS-FINAL-CHARGED-AMT  PIC 9(6)V99 VALUE 0.00.

       PROCEDURE DIVISION.
       0000-PROCESS-FEES.
           PERFORM 1000-CALC-BASE-FEE.
           IF WS-IS-INTERNATIONAL = "Y"
               PERFORM 2000-ADD-INTL-SURCHARGE
           END-IF.
           IF WS-IS-CASH-ADVANCE = "Y"
               PERFORM 3000-ADD-CASH-ADVANCE-FEE
           END-IF.
           PERFORM 4000-FINALIZE-TRANSACTION.
           STOP RUN.

       1000-CALC-BASE-FEE.
           IF WS-TRAN-AMOUNT > 1000.00
               COMPUTE WS-BASE-FEE = WS-TRAN-AMOUNT * 0.015
           ELSE
               COMPUTE WS-BASE-FEE = WS-TRAN-AMOUNT * 0.020
           END-IF.

       2000-ADD-INTL-SURCHARGE.
           COMPUTE WS-INTL-SURCHARGE = WS-TRAN-AMOUNT * 0.030.

       3000-ADD-CASH-ADVANCE-FEE.
           COMPUTE WS-CASH-ADV-FEE = WS-TRAN-AMOUNT * 0.050.

       4000-FINALIZE-TRANSACTION.
           COMPUTE WS-TOTAL-FEE = WS-BASE-FEE +
               WS-INTL-SURCHARGE + WS-CASH-ADV-FEE.
           COMPUTE WS-FINAL-CHARGED-AMT =
               WS-TRAN-AMOUNT + WS-TOTAL-FEE.
